Seif-Yasser-Ahmed/Minix3-OS/usr/pkg/man/man5/sshd_config.5
.TH SSHD_CONFIG 5 "December 8 2010 " ""
.SH NAME
\fBsshd_config\fP
\- OpenSSH SSH daemon configuration file
.SH SYNOPSIS
.br
\fB/usr/pkg/etc/ssh/sshd_config\fP
.SH DESCRIPTION
\fBsshd\fP(8)
reads configuration data from
\fI/usr/pkg/etc/ssh/sshd_config\fP
(or the file specified with
\fB\-f\fP
on the command line).
The file contains keyword-argument pairs, one per line.
Lines starting with
`#'
and empty lines are interpreted as comments.
Arguments may optionally be enclosed in double quotes
(\&")
in order to represent arguments containing spaces.

The possible
keywords and their meanings are as follows (note that
keywords are case-insensitive and arguments are case-sensitive):
.TP
\fBAcceptEnv\fP
Specifies what environment variables sent by the client will be copied into
the session's
\fBenviron\fP(7).
See
\fBSendEnv\fP
in
\fBssh_config\fP(5)
for how to configure the client.
Note that environment passing is only supported for protocol 2.
Variables are specified by name, which may contain the wildcard characters
`*'
and
`\&?'.
Multiple environment variables may be separated by whitespace or spread
across multiple
\fBAcceptEnv\fP
directives.
Be warned that some environment variables could be used to bypass restricted
user environments.
For this reason, care should be taken in the use of this directive.
The default is not to accept any environment variables.
.TP
\fBAddressFamily\fP
Specifies which address family should be used by
\fBsshd\fP(8).
Valid arguments are
``any'',
``inet''
(use IPv4 only), or
``inet6''
(use IPv6 only).
The default is
``any''.
.TP
\fBAllowAgentForwarding\fP
Specifies whether
\fBssh-agent\fP(1)
forwarding is permitted.
The default is
``yes''.
Note that disabling agent forwarding does not improve security
unless users are also denied shell access, as they can always install
their own forwarders.
.TP
\fBAllowGroups\fP
This keyword can be followed by a list of group name patterns, separated
by spaces.
If specified, login is allowed only for users whose primary
group or supplementary group list matches one of the patterns.
Only group names are valid; a numerical group ID is not recognized.
By default, login is allowed for all groups.
The allow/deny directives are processed in the following order:
\fBDenyUsers\fP,
\fBAllowUsers\fP,
\fBDenyGroups\fP,
and finally
\fBAllowGroups\fP.

See
.B PATTERNS
in
\fBssh_config\fP(5)
for more information on patterns.
.TP
\fBAllowTcpForwarding\fP
Specifies whether TCP forwarding is permitted.
The default is
``yes''.
Note that disabling TCP forwarding does not improve security unless
users are also denied shell access, as they can always install their
own forwarders.
.TP
\fBAllowUsers\fP
This keyword can be followed by a list of user name patterns, separated
by spaces.
If specified, login is allowed only for user names that
match one of the patterns.
Only user names are valid; a numerical user ID is not recognized.
By default, login is allowed for all users.
If the pattern takes the form USER@HOST then USER and HOST
are separately checked, restricting logins to particular
users from particular hosts.
The allow/deny directives are processed in the following order:
\fBDenyUsers\fP,
\fBAllowUsers\fP,
\fBDenyGroups\fP,
and finally
\fBAllowGroups\fP.

See
.B PATTERNS
in
\fBssh_config\fP(5)
for more information on patterns.
.TP
\fBAuthorizedKeysFile\fP
Specifies the file that contains the public keys that can be used
for user authentication.
The format is described in the
.B AUTHORIZED_KEYS FILE FORMAT
section of
\fBsshd\fP(8).
\fBAuthorizedKeysFile\fP
may contain tokens of the form %T which are substituted during connection
setup.
The following tokens are defined: %% is replaced by a literal '%',
%h is replaced by the home directory of the user being authenticated, and
%u is replaced by the username of that user.
After expansion,
\fBAuthorizedKeysFile\fP
is taken to be an absolute path or one relative to the user's home
directory.
The default is
``.ssh/authorized_keys''.
.TP
\fBAuthorizedPrincipalsFile\fP
Specifies a file that lists principal names that are accepted for
certificate authentication.
When using certificates signed by a key listed in
\fBTrustedUserCAKeys\fP,
this file lists names, one of which must appear in the certificate for it
to be accepted for authentication.
Names are listed one per line preceded by key options (as described
in
.B AUTHORIZED_KEYS FILE FORMAT
in
\fBsshd\fP(8)) .
Empty lines and comments starting with
`#'
are ignored.

\fBAuthorizedPrincipalsFile\fP
may contain tokens of the form %T which are substituted during connection
setup.
The following tokens are defined: %% is replaced by a literal '%',
%h is replaced by the home directory of the user being authenticated, and
%u is replaced by the username of that user.
After expansion,
\fBAuthorizedPrincipalsFile\fP
is taken to be an absolute path or one relative to the user's home
directory.

The default is not to use a principals file \(en in this case, the username
of the user must appear in a certificate's principals list for it to be
accepted.
Note that
\fBAuthorizedPrincipalsFile\fP
is only used when authentication proceeds using a CA listed in
\fBTrustedUserCAKeys\fP
and is not consulted for certification authorities trusted via
\fI~/.ssh/authorized_keys\fP,
though the
\fBprincipals=\fP
key option offers a similar facility (see
\fBsshd\fP(8)
for details).
.TP
\fBBanner\fP
The contents of the specified file are sent to the remote user before
authentication is allowed.
If the argument is
``none''
then no banner is displayed.
This option is only available for protocol version 2.
By default, no banner is displayed.
.TP
\fBChallengeResponseAuthentication\fP
Specifies whether challenge-response authentication is allowed (e.g. via
PAM or though authentication styles supported in
\fBlogin.conf\fP(5))
The default is
``yes''.
.TP
\fBChrootDirectory\fP
Specifies the pathname of a directory to
\fBchroot\fP(2)
to after authentication.
All components of the pathname must be root-owned directories that are
not writable by any other user or group.
After the chroot,
\fBsshd\fP(8)
changes the working directory to the user's home directory.

The pathname may contain the following tokens that are expanded at runtime once
the connecting user has been authenticated: %% is replaced by a literal '%',
%h is replaced by the home directory of the user being authenticated, and
%u is replaced by the username of that user.

The
\fBChrootDirectory\fP
must contain the necessary files and directories to support the
user's session.
For an interactive session this requires at least a shell, typically
\fBsh\fP(1),
and basic
\fI/dev\fP
nodes such as
\fBnull\fP(4),
\fBzero\fP(4),
\fBstdin\fP(4),
\fBstdout\fP(4),
\fBstderr\fP(4),
\fBarandom\fP(4)
and
\fBtty\fP(4)
devices.
For file transfer sessions using
``sftp'',
no additional configuration of the environment is necessary if the
in-process sftp server is used,
though sessions which use logging do require
\fI/dev/log\fP
inside the chroot directory (see
\fBsftp-server\fP(8)
for details).

The default is not to
\fBchroot\fP(2).
.TP
\fBCiphers\fP
Specifies the ciphers allowed for protocol version 2.
Multiple ciphers must be comma-separated.
The supported ciphers are
``3des-cbc'',
``aes128-cbc'',
``aes192-cbc'',
``aes256-cbc'',
``aes128-ctr'',
``aes192-ctr'',
``aes256-ctr'',
``arcfour128'',
``arcfour256'',
``arcfour'',
``blowfish-cbc'',
and
``cast128-cbc''.
The default is:

aes128-ctr,aes192-ctr,aes256-ctr,arcfour256,arcfour128,
.br
aes128-cbc,3des-cbc,blowfish-cbc,cast128-cbc,aes192-cbc,
.br
aes256-cbc,arcfour
.br
.TP
\fBClientAliveCountMax\fP
Sets the number of client alive messages (see below) which may be
sent without
\fBsshd\fP(8)
receiving any messages back from the client.
If this threshold is reached while client alive messages are being sent,
sshd will disconnect the client, terminating the session.
It is important to note that the use of client alive messages is very
different from
\fBTCPKeepAlive\fP
(below).
The client alive messages are sent through the encrypted channel
and therefore will not be spoofable.
The TCP keepalive option enabled by
\fBTCPKeepAlive\fP
is spoofable.
The client alive mechanism is valuable when the client or
server depend on knowing when a connection has become inactive.

The default value is 3.
If
\fBClientAliveInterval\fP
(see below) is set to 15, and
\fBClientAliveCountMax\fP
is left at the default, unresponsive SSH clients
will be disconnected after approximately 45 seconds.
This option applies to protocol version 2 only.
.TP
\fBClientAliveInterval\fP
Sets a timeout interval in seconds after which if no data has been received
from the client,
\fBsshd\fP(8)
will send a message through the encrypted
channel to request a response from the client.
The default
is 0, indicating that these messages will not be sent to the client.
This option applies to protocol version 2 only.
.TP
\fBCompression\fP
Specifies whether compression is allowed, or delayed until
the user has authenticated successfully.
The argument must be
``yes'',
``delayed'',
or
``no''.
The default is
``delayed''.
.TP
\fBDenyGroups\fP
This keyword can be followed by a list of group name patterns, separated
by spaces.
Login is disallowed for users whose primary group or supplementary
group list matches one of the patterns.
Only group names are valid; a numerical group ID is not recognized.
By default, login is allowed for all groups.
The allow/deny directives are processed in the following order:
\fBDenyUsers\fP,
\fBAllowUsers\fP,
\fBDenyGroups\fP,
and finally
\fBAllowGroups\fP.

See
.B PATTERNS
in
\fBssh_config\fP(5)
for more information on patterns.
.TP
\fBDenyUsers\fP
This keyword can be followed by a list of user name patterns, separated
by spaces.
Login is disallowed for user names that match one of the patterns.
Only user names are valid; a numerical user ID is not recognized.
By default, login is allowed for all users.
If the pattern takes the form USER@HOST then USER and HOST
are separately checked, restricting logins to particular
users from particular hosts.
The allow/deny directives are processed in the following order:
\fBDenyUsers\fP,
\fBAllowUsers\fP,
\fBDenyGroups\fP,
and finally
\fBAllowGroups\fP.

See
.B PATTERNS
in
\fBssh_config\fP(5)
for more information on patterns.
.TP
\fBForceCommand\fP
Forces the execution of the command specified by
\fBForceCommand\fP,
ignoring any command supplied by the client and
\fI~/.ssh/rc\fP
if present.
The command is invoked by using the user's login shell with the -c option.
This applies to shell, command, or subsystem execution.
It is most useful inside a
\fBMatch\fP
block.
The command originally supplied by the client is available in the
.IR SSH_ORIGINAL_COMMAND
environment variable.
Specifying a command of
``internal-sftp''
will force the use of an in-process sftp server that requires no support
files when used with
\fBChrootDirectory\fP.
.TP
\fBGatewayPorts\fP
Specifies whether remote hosts are allowed to connect to ports
forwarded for the client.
By default,
\fBsshd\fP(8)
binds remote port forwardings to the loopback address.
This prevents other remote hosts from connecting to forwarded ports.
\fBGatewayPorts\fP
can be used to specify that sshd
should allow remote port forwardings to bind to non-loopback addresses, thus
allowing other hosts to connect.
The argument may be
``no''
to force remote port forwardings to be available to the local host only,
``yes''
to force remote port forwardings to bind to the wildcard address, or
``clientspecified''
to allow the client to select the address to which the forwarding is bound.
The default is
``no''.
.TP
\fBGSSAPIAuthentication\fP
Specifies whether user authentication based on GSSAPI is allowed.
The default is
``no''.
Note that this option applies to protocol version 2 only.
.TP
\fBGSSAPICleanupCredentials\fP
Specifies whether to automatically destroy the user's credentials cache
on logout.
The default is
``yes''.
Note that this option applies to protocol version 2 only.
.TP
\fBHostbasedAuthentication\fP
Specifies whether rhosts or /etc/hosts.equiv authentication together
with successful public key client host authentication is allowed
(host-based authentication).
This option is similar to
\fBRhostsRSAAuthentication\fP
and applies to protocol version 2 only.
The default is
``no''.
.TP
\fBHostbasedUsesNameFromPacketOnly\fP
Specifies whether or not the server will attempt to perform a reverse
name lookup when matching the name in the
\fI~/.shosts\fP,
\fI~/.rhosts\fP,
and
\fI/etc/hosts.equiv\fP
files during
\fBHostbasedAuthentication\fP.
A setting of
``yes''
means that
\fBsshd\fP(8)
uses the name supplied by the client rather than
attempting to resolve the name from the TCP connection itself.
The default is
``no''.
.TP
\fBHostCertificate\fP
Specifies a file containing a public host certificate.
The certificate's public key must match a private host key already specified
by
\fBHostKey\fP.
The default behaviour of
\fBsshd\fP(8)
is not to load any certificates.
.TP
\fBHostKey\fP
Specifies a file containing a private host key
used by SSH.
The default is
\fI/usr/pkg/etc/ssh/ssh_host_key\fP
for protocol version 1, and
\fI/usr/pkg/etc/ssh/ssh_host_dsa_key\fP,
\fI/usr/pkg/etc/ssh/ssh_host_ecdsa_key\fP
and
\fI/usr/pkg/etc/ssh/ssh_host_rsa_key\fP
for protocol version 2.
Note that
\fBsshd\fP(8)
will refuse to use a file if it is group/world-accessible.
It is possible to have multiple host key files.
``rsa1''
keys are used for version 1 and
``dsa'',
``ecdsa''
or
``rsa''
are used for version 2 of the SSH protocol.
.TP
\fBIgnoreRhosts\fP
Specifies that
\fI\&.rhosts\fP
and
\fI\&.shosts\fP
files will not be used in
\fBRhostsRSAAuthentication\fP
or
\fBHostbasedAuthentication\fP.

\fI/etc/hosts.equiv\fP
and
\fI/usr/pkg/etc/ssh/shosts.equiv\fP
are still used.
The default is
``yes''.
.TP
\fBIgnoreUserKnownHosts\fP
Specifies whether
\fBsshd\fP(8)
should ignore the user's
\fI~/.ssh/known_hosts\fP
during
\fBRhostsRSAAuthentication\fP
or
\fBHostbasedAuthentication\fP.
The default is
``no''.
.TP
\fBIPQoS\fP
Specifies the IPv4 type-of-service or DSCP class for the connection.
Accepted values are
``af11'',
``af12'',
``af13'',
``af14'',
``af22'',
``af23'',
``af31'',
``af32'',
``af33'',
``af41'',
``af42'',
``af43'',
``cs0'',
``cs1'',
``cs2'',
``cs3'',
``cs4'',
``cs5'',
``cs6'',
``cs7'',
``ef'',
``lowdelay'',
``throughput'',
``reliability'',
or a numeric value.
This option may take one or two arguments, separated by whitespace.
If one argument is specified, it is used as the packet class unconditionally.
If two values are specified, the first is automatically selected for
interactive sessions and the second for non-interactive sessions.
The default is
``lowdelay''
for interactive sessions and
``throughput''
for non-interactive sessions.
.TP
\fBKerberosAuthentication\fP
Specifies whether the password provided by the user for
\fBPasswordAuthentication\fP
will be validated through the Kerberos KDC.
To use this option, the server needs a
Kerberos servtab which allows the verification of the KDC's identity.
The default is
``no''.
.TP
\fBKerberosGetAFSToken\fP
If AFS is active and the user has a Kerberos 5 TGT, attempt to acquire
an AFS token before accessing the user's home directory.
The default is
``no''.
.TP
\fBKerberosOrLocalPasswd\fP
If password authentication through Kerberos fails then
the password will be validated via any additional local mechanism
such as
\fI/etc/passwd\fP.
The default is
``yes''.
.TP
\fBKerberosTicketCleanup\fP
Specifies whether to automatically destroy the user's ticket cache
file on logout.
The default is
``yes''.
.TP
\fBKexAlgorithms\fP
Specifies the available KEX (Key Exchange) algorithms.
Multiple algorithms must be comma-separated.
The default is
``ecdh-sha2-nistp256'',
``ecdh-sha2-nistp384'',
``ecdh-sha2-nistp521'',
``diffie-hellman-group-exchange-sha256'',
``diffie-hellman-group-exchange-sha1'',
``diffie-hellman-group14-sha1'',
``diffie-hellman-group1-sha1''.
.TP
\fBKeyRegenerationInterval\fP
In protocol version 1, the ephemeral server key is automatically regenerated
after this many seconds (if it has been used).
The purpose of regeneration is to prevent
decrypting captured sessions by later breaking into the machine and
stealing the keys.
The key is never stored anywhere.
If the value is 0, the key is never regenerated.
The default is 3600 (seconds).
.TP
\fBListenAddress\fP
Specifies the local addresses
\fBsshd\fP(8)
should listen on.
The following forms may be used:

.IP
\fBListenAddress\fP
\fIhost\fP|\fIIPv4_addr\fP|\fIIPv6_addr\fP
.IP
\fBListenAddress\fP
\fIhost\fP|\fIIPv4_addr\fP:\fIport\fP
.IP
\fBListenAddress\fP
[\fIhost\fP|\fIIPv6_addr\fP]:\fIport\fP

If
\fIport\fP
is not specified,
sshd will listen on the address and all prior
\fBPort\fP
options specified.
The default is to listen on all local addresses.
Multiple
\fBListenAddress\fP
options are permitted.
Additionally, any
\fBPort\fP
options must precede this option for non-port qualified addresses.
.TP
\fBLoginGraceTime\fP
The server disconnects after this time if the user has not
successfully logged in.
If the value is 0, there is no time limit.
The default is 120 seconds.
.TP
\fBLogLevel\fP
Gives the verbosity level that is used when logging messages from
\fBsshd\fP(8).
The possible values are:
QUIET, FATAL, ERROR, INFO, VERBOSE, DEBUG, DEBUG1, DEBUG2, and DEBUG3.
The default is INFO.
DEBUG and DEBUG1 are equivalent.
DEBUG2 and DEBUG3 each specify higher levels of debugging output.
Logging with a DEBUG level violates the privacy of users and is not recommended.
.TP
\fBMACs\fP
Specifies the available MAC (message authentication code) algorithms.
The MAC algorithm is used in protocol version 2
for data integrity protection.
Multiple algorithms must be comma-separated.
The default is:

hmac-md5,hmac-sha1,umac-64@openssh.com,
.br
hmac-ripemd160,hmac-sha1-96,hmac-md5-96
.br
.TP
\fBMatch\fP
Introduces a conditional block.
If all of the criteria on the
\fBMatch\fP
line are satisfied, the keywords on the following lines override those
set in the global section of the config file, until either another
\fBMatch\fP
line or the end of the file.

The arguments to
\fBMatch\fP
are one or more criteria-pattern pairs.
The available criteria are
\fBUser\fP,
\fBGroup\fP,
\fBHost\fP,
and
\fBAddress\fP.
The match patterns may consist of single entries or comma-separated
lists and may use the wildcard and negation operators described in the
.B PATTERNS
section of
\fBssh_config\fP(5).

The patterns in an
\fBAddress\fP
criteria may additionally contain addresses to match in CIDR
address/masklen format, e.g.\&
``192.0.2.0/24''
or
``3ffe:ffff::/32''.
Note that the mask length provided must be consistent with the address -
it is an error to specify a mask length that is too long for the address
or one with bits set in this host portion of the address.
For example,
``192.0.2.0/33''
and
``192.0.2.0/8''
respectively.

Only a subset of keywords may be used on the lines following a
\fBMatch\fP
keyword.
Available keywords are
\fBAllowAgentForwarding\fP,
\fBAllowTcpForwarding\fP,
\fBAuthorizedKeysFile\fP,
\fBAuthorizedPrincipalsFile\fP,
\fBBanner\fP,
\fBChrootDirectory\fP,
\fBForceCommand\fP,
\fBGatewayPorts\fP,
\fBGSSAPIAuthentication\fP,
\fBHostbasedAuthentication\fP,
\fBHostbasedUsesNameFromPacketOnly\fP,
\fBKbdInteractiveAuthentication\fP,
\fBKerberosAuthentication\fP,
\fBMaxAuthTries\fP,
\fBMaxSessions\fP,
\fBPasswordAuthentication\fP,
\fBPermitEmptyPasswords\fP,
\fBPermitOpen\fP,
\fBPermitRootLogin\fP,
\fBPermitTunnel\fP,
\fBPubkeyAuthentication\fP,
\fBRhostsRSAAuthentication\fP,
\fBRSAAuthentication\fP,
\fBX11DisplayOffset\fP,
\fBX11Forwarding\fP
and
\fBX11UseLocalHost\fP.
.TP
\fBMaxAuthTries\fP
Specifies the maximum number of authentication attempts permitted per
connection.
Once the number of failures reaches half this value,
additional failures are logged.
The default is 6.
.TP
\fBMaxSessions\fP
Specifies the maximum number of open sessions permitted per network connection.
The default is 10.
.TP
\fBMaxStartups\fP
Specifies the maximum number of concurrent unauthenticated connections to the
SSH daemon.
Additional connections will be dropped until authentication succeeds or the
\fBLoginGraceTime\fP
expires for a connection.
The default is 10.

Alternatively, random early drop can be enabled by specifying
the three colon separated values
``start:rate:full''
(e.g. "10:30:60").
\fBsshd\fP(8)
will refuse connection attempts with a probability of
``rate/100''
(30%)
if there are currently
``start''
(10)
unauthenticated connections.
The probability increases linearly and all connection attempts
are refused if the number of unauthenticated connections reaches
``full''
(60).
.TP
\fBPasswordAuthentication\fP
Specifies whether password authentication is allowed.
The default is
``yes''.
.TP
\fBPermitEmptyPasswords\fP
When password authentication is allowed, it specifies whether the
server allows login to accounts with empty password strings.
The default is
``no''.
.TP
\fBPermitOpen\fP
Specifies the destinations to which TCP port forwarding is permitted.
The forwarding specification must be one of the following forms:

.IP
\fBPermitOpen\fP
\fIhost\fP:port
.IP
\fBPermitOpen\fP
\fIIPv4_addr\fP:port
.IP
\fBPermitOpen\fP
\fI\&[\fPIPv6_addr\&]:port

Multiple forwards may be specified by separating them with whitespace.
An argument of
``any''
can be used to remove all restrictions and permit any forwarding requests.
By default all port forwarding requests are permitted.
.TP
\fBPermitRootLogin\fP
Specifies whether root can log in using
\fBssh\fP(1).
The argument must be
``yes'',
``without-password'',
``forced-commands-only'',
or
``no''.
The default is
``yes''.

If this option is set to
``without-password'',
password authentication is disabled for root.

If this option is set to
``forced-commands-only'',
root login with public key authentication will be allowed,
but only if the
\fIcommand\fP
option has been specified
(which may be useful for taking remote backups even if root login is
normally not allowed).
All other authentication methods are disabled for root.

If this option is set to
``no'',
root is not allowed to log in.
.TP
\fBPermitTunnel\fP
Specifies whether
\fBtun\fP(4)
device forwarding is allowed.
The argument must be
``yes'',
``point-to-point''
(layer 3),
``ethernet''
(layer 2), or
``no''.
Specifying
``yes''
permits both
``point-to-point''
and
``ethernet''.
The default is
``no''.
.TP
\fBPermitUserEnvironment\fP
Specifies whether
\fI~/.ssh/environment\fP
and
\fBenvironment=\fP
options in
\fI~/.ssh/authorized_keys\fP
are processed by
\fBsshd\fP(8).
The default is
``no''.
Enabling environment processing may enable users to bypass access
restrictions in some configurations using mechanisms such as
.IR LD_PRELOAD .
.TP
\fBPidFile\fP
Specifies the file that contains the process ID of the
SSH daemon.
The default is
\fI/usr/var/run/sshd.pid\fP.
.TP
\fBPort\fP
Specifies the port number that
\fBsshd\fP(8)
listens on.
The default is 22.
Multiple options of this type are permitted.
See also
\fBListenAddress\fP.
.TP
\fBPrintLastLog\fP
Specifies whether
\fBsshd\fP(8)
should print the date and time of the last user login when a user logs
in interactively.
The default is
``yes''.
.TP
\fBPrintMotd\fP
Specifies whether
\fBsshd\fP(8)
should print
\fI/etc/motd\fP
when a user logs in interactively.
(On some systems it is also printed by the shell,
\fI/etc/profile\fP,
or equivalent.)
The default is
``yes''.
.TP
\fBProtocol\fP
Specifies the protocol versions
\fBsshd\fP(8)
supports.
The possible values are
`1'
and
`2'.
Multiple versions must be comma-separated.
The default is
`2'.
Note that the order of the protocol list does not indicate preference,
because the client selects among multiple protocol versions offered
by the server.
Specifying
``2,1''
is identical to
``1,2''.
.TP
\fBPubkeyAuthentication\fP
Specifies whether public key authentication is allowed.
The default is
``yes''.
Note that this option applies to protocol version 2 only.
.TP
\fBRevokedKeys\fP
Specifies a list of revoked public keys.
Keys listed in this file will be refused for public key authentication.
Note that if this file is not readable, then public key authentication will
be refused for all users.
.TP
\fBRhostsRSAAuthentication\fP
Specifies whether rhosts or /etc/hosts.equiv authentication together
with successful RSA host authentication is allowed.
The default is
``no''.
This option applies to protocol version 1 only.
.TP
\fBRSAAuthentication\fP
Specifies whether pure RSA authentication is allowed.
The default is
``yes''.
This option applies to protocol version 1 only.
.TP
\fBServerKeyBits\fP
Defines the number of bits in the ephemeral protocol version 1 server key.
The minimum value is 512, and the default is 1024.
.TP
\fBStrictModes\fP
Specifies whether
\fBsshd\fP(8)
should check file modes and ownership of the
user's files and home directory before accepting login.
This is normally desirable because novices sometimes accidentally leave their
directory or files world-writable.
The default is
``yes''.
Note that this does not apply to
\fBChrootDirectory\fP,
whose permissions and ownership are checked unconditionally.
.TP
\fBSubsystem\fP
Configures an external subsystem (e.g. file transfer daemon).
Arguments should be a subsystem name and a command (with optional arguments)
to execute upon subsystem request.

The command
\fBsftp-server\fP(8)
implements the
``sftp''
file transfer subsystem.

Alternately the name
``internal-sftp''
implements an in-process
``sftp''
server.
This may simplify configurations using
\fBChrootDirectory\fP
to force a different filesystem root on clients.

By default no subsystems are defined.
Note that this option applies to protocol version 2 only.
.TP
\fBSyslogFacility\fP
Gives the facility code that is used when logging messages from
\fBsshd\fP(8).
The possible values are: DAEMON, USER, AUTH, LOCAL0, LOCAL1, LOCAL2,
LOCAL3, LOCAL4, LOCAL5, LOCAL6, LOCAL7.
The default is AUTH.
.TP
\fBTCPKeepAlive\fP
Specifies whether the system should send TCP keepalive messages to the
other side.
If they are sent, death of the connection or crash of one
of the machines will be properly noticed.
However, this means that
connections will die if the route is down temporarily, and some people
find it annoying.
On the other hand, if TCP keepalives are not sent,
sessions may hang indefinitely on the server, leaving
``ghost''
users and consuming server resources.

The default is
``yes''
(to send TCP keepalive messages), and the server will notice
if the network goes down or the client host crashes.
This avoids infinitely hanging sessions.

To disable TCP keepalive messages, the value should be set to
``no''.
.TP
\fBTrustedUserCAKeys\fP
Specifies a file containing public keys of certificate authorities that are
trusted to sign user certificates for authentication.
Keys are listed one per line; empty lines and comments starting with
`#'
are allowed.
If a certificate is presented for authentication and has its signing CA key
listed in this file, then it may be used for authentication for any user
listed in the certificate's principals list.
Note that certificates that lack a list of principals will not be permitted
for authentication using
\fBTrustedUserCAKeys\fP.
For more details on certificates, see the
.B CERTIFICATES
section in
\fBssh-keygen\fP(1).
.TP
\fBUseDNS\fP
Specifies whether
\fBsshd\fP(8)
should look up the remote host name and check that
the resolved host name for the remote IP address maps back to the
very same IP address.
The default is
``yes''.
.TP
\fBUseLogin\fP
Specifies whether
\fBlogin\fP(1)
is used for interactive login sessions.
The default is
``no''.
Note that
\fBlogin\fP(1)
is never used for remote command execution.
Note also, that if this is enabled,
\fBX11Forwarding\fP
will be disabled because
\fBlogin\fP(1)
does not know how to handle
\fBxauth\fP(1)
cookies.
If
\fBUsePrivilegeSeparation\fP
is specified, it will be disabled after authentication.
.TP
\fBUsePAM\fP
Enables the Pluggable Authentication Module interface.
If set to
``yes''
this will enable PAM authentication using
\fBChallengeResponseAuthentication\fP
and
\fBPasswordAuthentication\fP
in addition to PAM account and session module processing for all
authentication types.

Because PAM challenge-response authentication usually serves an equivalent
role to password authentication, you should disable either
\fBPasswordAuthentication\fP
or
\fBChallengeResponseAuthentication.\fP

If
\fBUsePAM\fP
is enabled, you will not be able to run
\fBsshd\fP(8)
as a non-root user.
The default is
``no''.
.TP
\fBUsePrivilegeSeparation\fP
Specifies whether
\fBsshd\fP(8)
separates privileges by creating an unprivileged child process
to deal with incoming network traffic.
After successful authentication, another process will be created that has
the privilege of the authenticated user.
The goal of privilege separation is to prevent privilege
escalation by containing any corruption within the unprivileged processes.
The default is
``yes''.
.TP
\fBX11DisplayOffset\fP
Specifies the first display number available for
\fBsshd\fP(8)Ns 's
X11 forwarding.
This prevents sshd from interfering with real X11 servers.
The default is 10.
.TP
\fBX11Forwarding\fP
Specifies whether X11 forwarding is permitted.
The argument must be
``yes''
or
``no''.
The default is
``no''.

When X11 forwarding is enabled, there may be additional exposure to
the server and to client displays if the
\fBsshd\fP(8)
proxy display is configured to listen on the wildcard address (see
\fBX11UseLocalhost\fP
below), though this is not the default.
Additionally, the authentication spoofing and authentication data
verification and substitution occur on the client side.
The security risk of using X11 forwarding is that the client's X11
display server may be exposed to attack when the SSH client requests
forwarding (see the warnings for
\fBForwardX11\fP
in
\fBssh_config\fP(5)) .
A system administrator may have a stance in which they want to
protect clients that may expose themselves to attack by unwittingly
requesting X11 forwarding, which can warrant a
``no''
setting.

Note that disabling X11 forwarding does not prevent users from
forwarding X11 traffic, as users can always install their own forwarders.
X11 forwarding is automatically disabled if
\fBUseLogin\fP
is enabled.
.TP
\fBX11UseLocalhost\fP
Specifies whether
\fBsshd\fP(8)
should bind the X11 forwarding server to the loopback address or to
the wildcard address.
By default,
sshd binds the forwarding server to the loopback address and sets the
hostname part of the
.IR DISPLAY
environment variable to
``localhost''.
This prevents remote hosts from connecting to the proxy display.
However, some older X11 clients may not function with this
configuration.
\fBX11UseLocalhost\fP
may be set to
``no''
to specify that the forwarding server should be bound to the wildcard
address.
The argument must be
``yes''
or
``no''.
The default is
``yes''.
.TP
\fBXAuthLocation\fP
Specifies the full pathname of the
\fBxauth\fP(1)
program.
The default is
\fI/usr/pkg/bin/xauth\fP.
.SH TIME FORMATS
\fBsshd\fP(8)
command-line arguments and configuration file options that specify time
may be expressed using a sequence of the form:
\fItime\fP[\fIqualifier\fP,]
where
\fItime\fP
is a positive integer value and
\fIqualifier\fP
is one of the following:

.TP
<\fBnone\fP>
seconds
.TP
\fBs\fP | \fBS\fP
seconds
.TP
\fBm\fP | \fBM\fP
minutes
.TP
\fBh\fP | \fBH\fP
hours
.TP
\fBd\fP | \fBD\fP
days
.TP
\fBw\fP | \fBW\fP
weeks

Each member of the sequence is added together to calculate
the total time value.

Time format examples:

.TP
600
600 seconds (10 minutes)
.TP
10m
10 minutes
.TP
1h30m
1 hour 30 minutes (90 minutes)
.SH FILES
.TP
.B /usr/pkg/etc/ssh/sshd_config
Contains configuration data for
\fBsshd\fP(8).
This file should be writable by root only, but it is recommended
(though not necessary) that it be world-readable.
.SH SEE ALSO
\fBsshd\fP(8)
.SH AUTHORS
OpenSSH is a derivative of the original and free
ssh 1.2.12 release by Tatu Ylonen.
Aaron Campbell, Bob Beck, Markus Friedl, Niels Provos,
Theo de Raadt and Dug Song
removed many bugs, re-added newer features and
created OpenSSH.
Markus Friedl contributed the support for SSH
protocol versions 1.5 and 2.0.
Niels Provos and Markus Friedl contributed support
for privilege separation.
